# Aula 3: SQL

## Introdução

Nesta aula veremos as principais queries de consulta em sql

## Conexao no db4free via sqlalchemy

In [3]:
!pip install pandasql

Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.19.5)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.1.5)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.4.20)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas->pandasql) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas->pandasql) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy->pandasql) (4.6.1)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy->pandasql) (1.1.0)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy->pandasql) (3.5.0)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy->pandasql) (3.7.4.3)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26782 sha256=c2aa4682b56b8ce96929cde3f4124b3955311def76133e7f52e4db140b46d6f6
  Stored in directory: /root/.cache/pip/wheels/5c/4b/ec/41f4e116c8053c3654e2c2a47c62b4fca34cc67ef7b55deb7f
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [4]:
import yaml
import sqlalchemy
import pandas as pd
from pandasql import sqldf

In [9]:
!pip install PyYAML

Requirement already satisfied: PyYAML in /usr/local/lib/python3.7/dist-packages (5.4.1)

In [12]:
!pip install SQLAlchemy

Requirement already satisfied: SQLAlchemy in /usr/local/lib/python3.7/dist-packages (1.4.20)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from SQLAlchemy) (1.1.0)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from SQLAlchemy) (4.6.1)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->SQLAlchemy) (3.7.4.3)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->SQLAlchemy) (3.5.0)

In [13]:
!pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.0.3.tar.gz (88 kB)
     |████████████████████████████████| 88 kB 4.6 MB/s
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (setup.py) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.0.3-cp37-cp37m-linux_x86_64.whl size=100139 sha256=d9c1080ca7727796621a941b8eae5c273211d8f78f7416e932c7e6d57686e608
  Stored in directory: /root/.cache/pip/wheels/79/1c/f8/11fafab45fe6696eea63794a5d747b9c6b54990ac6f1885fb7
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.0.3

In [15]:
# Load SQL credentials
with open('credentials.yml', 'r') as file:
    credentials = yaml.load(file, Loader=yaml.FullLoader)

- A engine deve estar no formato:
- mysql://`user`:`password`@`host`:`port`/`database`

In [16]:
engine = sqlalchemy.create_engine(f'mysql://{credentials["user"]}:{credentials["password"]}@{credentials["host"]}:{credentials["port"]}/{credentials["database"]}') # connect to server

### UPLOAD TABLE

In [17]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5'],
        'first_name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches'],
        'value': [20, 30, 50, 80, 100]}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name', 'value'])
df_a

  subject_id first_name last_name  value
0          1       Alex  Anderson     20
1          2        Amy  Ackerman     30
2          3      Allen       Ali     50
3          4      Alice      Aoni     80
4          5     Ayoung   Atiches    100

In [18]:
raw_data = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan'],
        'value': [15, 5, 70, 35, 10]}
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name', 'value'])
df_b

  subject_id first_name last_name  value
0          4      Billy    Bonder     15
1          5      Brian     Black      5
2          6       Bran   Balwner     70
3          7      Bryce     Brice     35
4          8      Betty    Btisan     10

In [9]:
!pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.0.3.tar.gz (88 kB)
     |████████████████████████████████| 88 kB 3.5 MB/s
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (setup.py) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.0.3-cp37-cp37m-linux_x86_64.whl size=100137 sha256=0df152e470ed4cd848e98d2b92fb8b86439e27d07ae7ee5a1719ac2186db4305
  Stored in directory: /root/.cache/pip/wheels/79/1c/f8/11fafab45fe6696eea63794a5d747b9c6b54990ac6f1885fb7
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.0.3

In [19]:
engine = sqlalchemy.create_engine(f'mysql://{credentials["user"]}:{credentials["password"]}@{credentials["host"]}:{credentials["port"]}/{credentials["database"]}') # connect to server

In [20]:
df_a.to_sql('df_a', engine, if_exists='replace')
df_b.to_sql('df_b', engine, if_exists='replace')

In [21]:
query = '''
    SELECT *
    FROM df_a
'''
pd.read_sql_query(query, engine)

   index subject_id first_name last_name  value
0      0          1       Alex  Anderson     20
1      1          2        Amy  Ackerman     30
2      2          3      Allen       Ali     50
3      3          4      Alice      Aoni     80
4      4          5     Ayoung   Atiches    100

In [22]:
query = '''
    SELECT *
    FROM df_b
'''
pd.read_sql_query(query, engine)

   index subject_id first_name last_name  value
0      0          4      Billy    Bonder     15
1      1          5      Brian     Black      5
2      2          6       Bran   Balwner     70
3      3          7      Bryce     Brice     35
4      4          8      Betty    Btisan     10

## JOIN

![](https://www.dofactory.com/img/sql/sql-joins.png)

In [23]:
query = '''
    SELECT *
    FROM df_a AS a
    JOIN df_b AS b
    ON a.subject_id = b.subject_id
'''
pd.read_sql_query(query, engine)

   index  subject_id  first_name last_name  ...  subject_id  first_name last_name value
0      3           4       Alice      Aoni  ...           4       Billy    Bonder    15
1      4           5      Ayoung   Atiches  ...           5       Brian     Black     5

[2 rows x 10 columns]

In [24]:
query = '''
    SELECT *
    FROM df_a AS a
    JOIN df_b AS b
    ON a.subject_id = b.subject_id
'''

sqldf(query)

  subject_id first_name last_name  value subject_id first_name last_name  value
0          4      Alice      Aoni     80          4      Billy    Bonder     15
1          5     Ayoung   Atiches    100          5      Brian     Black      5

In [25]:
query = '''
    SELECT *
    FROM df_a AS a
    INNER JOIN df_b AS b
    ON a.subject_id = b.subject_id
'''
pd.read_sql_query(query, engine)

   index  subject_id  first_name last_name  ...  subject_id  first_name last_name value
0      3           4       Alice      Aoni  ...           4       Billy    Bonder    15
1      4           5      Ayoung   Atiches  ...           5       Brian     Black     5

[2 rows x 10 columns]

### LEFT JOIN

In [26]:
query = '''
    SELECT *
    FROM df_a
'''
pd.read_sql_query(query, engine)

   index subject_id first_name last_name  value
0      0          1       Alex  Anderson     20
1      1          2        Amy  Ackerman     30
2      2          3      Allen       Ali     50
3      3          4      Alice      Aoni     80
4      4          5     Ayoung   Atiches    100

In [27]:
query = '''
    SELECT *
    FROM df_a AS a
    LEFT JOIN df_b AS b
    ON a.subject_id = b.subject_id
'''
pd.read_sql_query(query, engine)

   index  subject_id  first_name last_name  ...  subject_id  first_name last_name value
0      0           1        Alex  Anderson  ...        None        None      None   NaN
1      1           2         Amy  Ackerman  ...        None        None      None   NaN
2      2           3       Allen       Ali  ...        None        None      None   NaN
3      3           4       Alice      Aoni  ...           4       Billy    Bonder  15.0
4      4           5      Ayoung   Atiches  ...           5       Brian     Black   5.0

[5 rows x 10 columns]

### RIGHT JOIN

In [28]:
query = '''
    SELECT *
    FROM df_a AS a
    RIGHT JOIN df_b AS b
    ON a.subject_id = b.subject_id
'''
pd.read_sql_query(query, engine)

   index  subject_id  first_name last_name  ...  subject_id  first_name last_name value
0    3.0           4       Alice      Aoni  ...           4       Billy    Bonder    15
1    4.0           5      Ayoung   Atiches  ...           5       Brian     Black     5
2    NaN        None        None      None  ...           6        Bran   Balwner    70
3    NaN        None        None      None  ...           7       Bryce     Brice    35
4    NaN        None        None      None  ...           8       Betty    Btisan    10

[5 rows x 10 columns]

## UNION

In [29]:
query = '''
    SELECT * FROM df_a    
    UNION
    SELECT * FROM df_b
'''
pd.read_sql_query(query, engine)

   index subject_id first_name last_name  value
0      0          1       Alex  Anderson     20
1      1          2        Amy  Ackerman     30
2      2          3      Allen       Ali     50
3      3          4      Alice      Aoni     80
4      4          5     Ayoung   Atiches    100
5      0          4      Billy    Bonder     15
6      1          5      Brian     Black      5
7      2          6       Bran   Balwner     70
8      3          7      Bryce     Brice     35
9      4          8      Betty    Btisan     10

In [30]:
query = '''
    SELECT * FROM df_a    
    UNION
    SELECT * FROM df_b
'''

sqldf(query)

  subject_id first_name last_name  value
0          1       Alex  Anderson     20
1          2        Amy  Ackerman     30
2          3      Allen       Ali     50
3          4      Alice      Aoni     80
4          4      Billy    Bonder     15
5          5     Ayoung   Atiches    100
6          5      Brian     Black      5
7          6       Bran   Balwner     70
8          7      Bryce     Brice     35
9          8      Betty    Btisan     10

## CASE

Comando `CASE` se assemelha a uma condicional `se..., então` e sua sintaxe é:

`CASE
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    WHEN conditionN THEN resultN
    ELSE result
END;`

In [31]:
query = '''
    SELECT * FROM df_a    

'''
pd.read_sql_query(query, engine)

   index subject_id first_name last_name  value
0      0          1       Alex  Anderson     20
1      1          2        Amy  Ackerman     30
2      2          3      Allen       Ali     50
3      3          4      Alice      Aoni     80
4      4          5     Ayoung   Atiches    100

In [32]:
query = '''
    SELECT *, 
        CASE 
            WHEN value > 50 THEN "maior_que_50"
            WHEN value > 20 THEN "maior_que_30"
            ELSE "menor_que_30"
        END AS value_category
            
    FROM df_a    

'''
pd.read_sql_query(query, engine)

   index subject_id first_name last_name  value value_category
0      0          1       Alex  Anderson     20   menor_que_30
1      1          2        Amy  Ackerman     30   maior_que_30
2      2          3      Allen       Ali     50   maior_que_30
3      3          4      Alice      Aoni     80   maior_que_50
4      4          5     Ayoung   Atiches    100   maior_que_50

In [33]:
query = '''
    SELECT *, 
        CASE 
            WHEN value > 50 THEN "maior_que_50"
            WHEN value > 20 THEN "maior_que_30"
            ELSE "menor_que_30"
        END AS value_category
            
    FROM df_a    

'''

sqldf(query)

  subject_id first_name last_name  value value_category
0          1       Alex  Anderson     20   menor_que_30
1          2        Amy  Ackerman     30   maior_que_30
2          3      Allen       Ali     50   maior_que_30
3          4      Alice      Aoni     80   maior_que_50
4          5     Ayoung   Atiches    100   maior_que_50